In [2]:
import pandas as pd
import numpy as np

In [3]:
# rename 修改 列名 与 索引

In [4]:
data = {'company': ['B', 'A', 'B', 'B'],
         'gender': ['female', 'female', 'male','male'],
         'num': [40, 31, 28,28]}

In [5]:
df = pd.DataFrame(data)

In [6]:
df

  company  gender  num
0       B  female   40
1       A  female   31
2       B    male   28
3       B    male   28

In [ ]:
# 将列名 num --> age
# 将索引 0-3 --> A-D

In [16]:
df.rename(columns={'num':'age'},index={0:'A',1:'B',2:'C',3:'D'},inplace=True)

In [17]:
df

  company  gender  age
A       B  female   40
B       A  female   31
C       B    male   28
D       B    male   28

In [ ]:
# set_index
# 将DataFrame中的某一（多）个字段设置为索引

In [20]:
df.set_index(['company','gender'],inplace=True)

In [21]:
df

                age
company gender
B       female   40
A       female   31
B       male     28
        male     28

In [50]:
# reset_index
# 重置索引
# drop=True  删除原索引
# drop=False 保留原索引，并作为DataFrame新字段

In [26]:
df.reset_index(drop=False,inplace=True)

In [27]:
df

  company  gender  age
0       B  female   40
1       A  female   31
2       B    male   28
3       B    male   28

In [52]:
# drop_duplicates
# 去除重复值
# subset 可指定列作为主键
# keep first/last，默认first

In [30]:
df.drop_duplicates(subset=['company'],keep='last')

  company  gender  age
1       A  female   31
3       B    male   28

In [ ]:
# drop
# 可删除 DataFrame 指定列与索引

In [31]:
df

  company  gender  age
0       B  female   40
1       A  female   31
2       B    male   28
3       B    male   28

In [33]:
df.drop(columns='age',index=0)

  company  gender
1       A  female
2       B    male
3       B    male

In [1]:
# isin
# 常用于构建布尔索引，对DataFrame的数据进行条件筛选

In [34]:
df

  company  gender  age
0       B  female   40
1       A  female   31
2       B    male   28
3       B    male   28

In [35]:
df.loc[df.gender.isin(['male'])]

  company gender  age
2       B   male   28
3       B   male   28

In [36]:
df.loc[df.company.isin(['A'])]

  company  gender  age
1       A  female   31